100_cylinderAxialSymmetry/001_laminar_U0.1/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

// 初期値 Cmu^(3/4) * k^(3/2)/lm = 0.09^(3/4) * 0.00375^(3/2)/0.0014 = 0.026953
internalField   uniform 0.026953;

boundaryField
{
    inlet
    {
	type turbulentMixingLengthDissipationRateInlet; // 混合長さ
	mixingLength 0.0014; // 混合長さl=0.07*d. d=0.02(直径)
	value $internalField; 
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    sideWall
    {
	type epsilonWallFunction;
	value $internalField;

    }
    front
    {
	    type	wedge;
    }
    back
    {
	    type	wedge;
    }
}


// ************************************************************************* //
