100_cylinderAxialSymmetry/001_laminar_U0.1/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

//初期値 omega=epsilon/k/Cmu=k^0.5/Cmu^0.25/lm = 0.00375^0.5/0.09^0.25/(0.07*0.02 ) 
internalField   uniform 79.8; 

boundaryField
{
    inlet
    {
        //type            fixedValue;
        //value           $internalField;
 	type turbulentMixingLengthFrequencyInlet; // 混合長さ
	value $internalField; 
	mixingLength 0.0014; // 混合長さl=0.07*d. d=0.02(直径)
    }

    outlet
    {
        type            zeroGradient;
    }

    sideWall
    {
        type            omegaWallFunction;
        value           $internalField;

    }
    front
    {
	    type	wedge;
    }
    back
    {
	    type	wedge;
    }
}


// ************************************************************************* //
